{
  "overall_summary": "ภาพรวมปลายภาค เด็กชาย ก้อง (ป.4/1, กลุ่ม Needs Practice – เน้นความแม่นยำและพื้นฐาน): ก้องทำงานที่ครูมอบหมายได้ครบตามเป้าหมายในเรื่องบวก–ลบมีทด และเกือบครบในเรื่องเปรียบเทียบเศษส่วน แม้ความแม่นยำเรื่องบวก–ลบมีทดอยู่ในเกณฑ์ดี แต่ความแม่นยำเรื่องเปรียบเทียบเศษส่วนยังต้องเสริมเพิ่มเติม ด้านพฤติกรรมการเรียนมีความสม่ำเสมอและแนวโน้มดีขึ้นในช่วง 2 สัปดาห์หลัง ถือเป็นจุดแข็งที่สนับสนุนการพัฒนาในเทอมถัดไป",
  "strengths": [
    "ทำงานที่มอบหมายครบตามเป้าในบวก–ลบมีทด และเกือบครบในเศษส่วน",
    "ความแม่นยำบวก–ลบมีทดอยู่ในเกณฑ์ดี สะท้อนความเข้าใจขั้นตอนพื้นฐาน",
    "มีวินัยการเรียนต่อเนื่อง แนวโน้มการมีส่วนร่วมดีขึ้น และมีการฝึกเพิ่มเติมนอกงานที่มอบหมาย"
  ],
  "focus_areas": [
    "เปรียบเทียบเศษส่วนที่ตัวส่วนต่างกัน: เน้นหาตัวส่วนร่วมเล็กสุดหรือเทียบกับ 1/2 และ 1 เพื่อเพิ่มความแม่นยำ",
    "ทบทวนและตรวจทานขั้นตอนบวก–ลบมีทด โดยเฉพาะการยืม/ทด เพื่อคงความถูกต้องสม่ำเสมอ",
    "จัดจังหวะการทำข้อให้คงที่ (ค่อยๆ ทำแต่สม่ำเสมอ) เพื่อลดข้อผิดพลาดจากความเร่งรีบ"
  ],
  "evidence": [
    {
      "skill": "Fractions: compare (ตัวส่วนต่างกัน)",
      "assigned_completion": "28/30 (93%)",
      "assigned_accuracy": "18/28 (64%)",
      "notes": "เวลาเฉลี่ย 41 วินาที/ข้อ, อัตราลองใหม่ 32% — ทำได้ใกล้ครบตามเป้า แต่ความแม่นยำยังต่ำกว่าที่คาดสำหรับกลุ่ม Needs Practice"
    },
    {
      "skill": "Addition/Subtraction: regrouping (ทด/ยืม)",
      "assigned_completion": "25/25 (100%)",
      "assigned_accuracy": "21/25 (84%)",
      "notes": "เวลาเฉลี่ย 33 วินาที/ข้อ, อัตราลองใหม่ 12% — ความแม่นยำดีและทำงานครบตามที่มอบหมาย"
    }
  ],
  "learning_habits": [
    "มีวันเข้าเรียน/ทำงานสม่ำเสมอ 14 วัน และแนวโน้ม 2 สัปดาห์ล่าสุดดีขึ้น",
    "มีการฝึกเพิ่มเติมนอกงานที่มอบหมาย (เศษส่วนและโจทย์ปัญหา) แสดงถึงความตั้งใจพัฒนา",
    "รักษาช่วงเวลาฝึกที่คงที่ ช่วยให้ทำงานที่มอบหมายได้ต่อเนื่อง"
  ],
  "next_steps_2_weeks": [
    {
      "action": "ฝึกเปรียบเทียบเศษส่วนวันละ 10 ข้อ โดยใช้วิธีหาตัวส่วนร่วมเล็กสุด/วาดเส้นจำนวน",
      "why": "เพิ่มความแม่นยำในทักษะที่ยังต่ำกว่าคาด (64%) ตามเป้าหมายกลุ่ม Needs Practice",
      "how": "เลือกชุดข้อแบบง่าย–กลาง สลับโจทย์เทียบกับ 1/2 และ 1 ตรวจคำตอบทุกข้อ พร้อมอธิบายเหตุผลสั้นๆ 1 ประโยค"
    },
    {
      "action": "ทบทวนบวก–ลบมีทด 3 วัน/สัปดาห์ ครั้งละ 15 นาที พร้อมเช็คขั้นตอน 3 จุด",
      "why": "คงความแม่นยำระดับดี (84%) และลดข้อผิดพลาดจากการยืม/ทด",
      "how": "ทำชุด 8–10 ข้อ/ครั้ง ใช้เช็กลิสต์: จัดตำแหน่งหลักเลข ถูกต้อง? ทด/ยืมครบ? ตรวจย้อนด้วยการคำนวณกลับ"
    },
    {
      "action": "ตั้งเวลาเรียนสั้นแต่สม่ำเสมอหลังการบ้านหลัก 15 นาที สัปดาห์ละ 4 วัน",
      "why": "รักษาโมเมนตัมการเรียนที่กำลังดีขึ้นและลดความเร่งรีบที่ทำให้ผิดพลาด",
      "how": "ใช้ตัวจับเวลา แบ่งเวลา: อบอุ่นสมอง 3 นาที + ฝึกเศษส่วน 8 นาที + ตรวจทาน 4 นาที จดคะแนนถูก/รวมสั้นๆ"
    }
  ],
  "encouragement": "ขอบคุณก้องที่ตั้งใจและสม่ำเสมอ เห็นความพยายามชัดเจนในช่วงท้ายเทอม ขอให้รักษานิสัยการฝึกอย่างต่อเนื่อง และค่อยๆ เสริมความแม่นยำเรื่องเศษส่วน คุณครูและผู้ปกครองเชื่อมั่นว่าก้องทำได้",
  "flags_for_teacher_followup": [
    "ขอเวลาสอนเสริมสั้นๆ เรื่องเปรียบเทียบเศษส่วน (เลือกใช้ตัวส่วนร่วม/เทียบกับค่าอ้างอิง 1/2, 1) พร้อมแบบฝึกตัวอย่าง",
    "ตรวจสอบความเข้าใจเรื่องไม่ควรเทียบเฉพาะตัวเศษหรือตัวส่วนล้วนๆ ในเศษส่วนตัวส่วนต่างกัน"
  ]
}